HW2/app/controllers/users_controller.rb

  def show
    @microposts_of_user = Micropost.where("user_id=?",@user.id)
---
SELECT "microposts".* FROM "microposts" WHERE (user_id=1)